Revit 2027 API
EdgeArrayArray.Item Property
Gets or sets an edge array at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual EdgeArray this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As EdgeArray
	Get
	Set
public:
virtual property EdgeArray^ Item[int index] {
	EdgeArray^ get (int index);
	void set (int index, EdgeArray^ value);
}
abstract Item : EdgeArray with get, set
override Item : EdgeArray with get, set
Parameters
index Int32
The index of the edge array to be set or retrieved.
Return Value
EdgeArray
Returns the edge array at the specified index.
See Also
Reference
EdgeArrayArray Class
Autodesk.Revit.DB Namespace